Autodesk.Revit.DB.CustomExporter.Export(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Exports a collection of 3-D views
Remarks:
It needs be noted that the actual export process may differ
depending on the type of export context used. For example, when the
Autodesk::Revit::DB::IModelExportContext is used,
Revit is likely to perform several rounds of traversing each view, which
may result in invoking the OnViewBegin/OnViewEnd method multiple times
for every one view. It is because Revit draws objects in several layers
(model layer, annotation layer, etc.) and will traverse each layer individually.
In the most common scenario the user will receive two invocations of OnViewBegin/OnViewEnd:
In the first round, all model entities will be received, while in the second round
all text annotation elements will be received, if any present in the given view.
viewIds:
An array of 3-D views to export
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements in viewIds is not a valid 3D view.
For example, templates are not considered valid views to export.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The instance of IExportContext is not valid.
-or-
Rendering is currently not supported in the running instance of Revit.
One reason for that to happen is that rendering and material libraries
are not currently available.
Since:
2014

Autodesk.Revit.DB.CustomExporter.IncludeFaces
This flag sets the exporter to either include or exclude
notifications about faces being processed in the export context.
Since:
2014